wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_spi.c
#ifdef FW_DEBUG_ERR_REPORT
    if(0U == i2s_audiosample) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0007U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* deinit SPI_I2SPSC register */
        SPI_I2SPSC(spi_periph) = SPI_I2SPSC_DEFAULT_VALUE;

        /* get the I2S clock source */
        if((spi_periph) == SPI1){
            /* I2S1 clock source selection */
            clks = I2S1_CLOCK_SEL;
        }else{
            /* I2S2 clock source selection */
            clks = I2S2_CLOCK_SEL;
        }
        
        /*get PLL1 clock source*/
        if(0U != (RCU_CFG1 & RCU_CFG1_PLL1SEL)){
            pll1s = IRC48M_VALUE; 
        }else{
            pll1s = HXTAL_VALUE;
        }
        
        if(0U != (RCU_CFG1 & clks)){
            /* get RCU PLL1 clock multiplication factor */
            clks = (uint32_t)((RCU_CFG1 & I2S_CLOCK_MUL_MASK) >> 8U);

            /* get the PREDV1 value */
            i2sclock = (uint32_t)(((RCU_CFG1 & I2S_CLOCK_DIV_MASK) >> 4U) + 1U);
            /* calculate i2sclock based on PLL1 and PREDV1 */
            i2sclock = (uint32_t)((pll1s / i2sclock) * clks); 
       
        }else{
            /* get system clock */
            i2sclock = rcu_clock_freq_get(CK_SYS);
        }
        
        /* get the i2sdiv value after i2ssel */
        if((spi_periph) == SPI1){
            /* I2S1 clock divide selection */
            i2s_sel_div = (uint32_t)(((RCU_ADDCTL & I2S1_CLOCK_DIV1_MASK) >> 3U) + 1U);
        }else{
            /* I2S2 clock divide selection */
            i2s_sel_div = (uint32_t)(((RCU_ADDCTL & I2S2_CLOCK_DIV1_MASK) >> 18U) + 1U);
        }

        /* calculate i2sclock*/
        i2sclock = (uint32_t)(i2sclock / i2s_sel_div);
        
        /* config the prescaler depending on the mclk output state, the frame format and audio sample rate */
        if(I2S_MCKOUT_ENABLE == i2s_mckout){
            clks = (uint32_t)(((i2sclock / 256U) * 10U) / i2s_audiosample);
        }else{
            if(I2S_FRAMEFORMAT_DT16B_CH16B == i2s_frameformat){
                clks = (uint32_t)(((i2sclock / 32U) *10U ) / i2s_audiosample);
            }else{
                clks = (uint32_t)(((i2sclock / 64U) *10U ) / i2s_audiosample);
            }
        }
        
        /* remove the floating point */
        clks   = (clks + 5U) / 10U;
        i2sof  = (clks & 0x00000001U);
        i2sdiv = ((clks - i2sof) / 2U);
        i2sof  = (i2sof << 8U);

        /* set the default values */
        if((i2sdiv < 2U) || (i2sdiv > 255U)){
            i2sdiv = 2U;
            i2sof = 0U;
        }

        /* configure SPI_I2SPSC */
        SPI_I2SPSC(spi_periph) = i2sdiv | i2sof | (i2s_mckout & SPI_I2SPSC_MCKOEN);

        /* clear SPI_I2SCTL_DTLEN and SPI_I2SCTL_CHLEN bits */
        SPI_I2SCTL(spi_periph) &= ~(SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN);
        /* configure data frame format */
        SPI_I2SCTL(spi_periph) |= (i2s_frameformat & (SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN));
    }
}

/*!
    \brief      enable I2S (API_ID: 0x0008U)
    \param[in]  spi_periph: SPIx(x=1,2)
    \param[out] none
    \retval     none
*/
void i2s_enable(uint32_t spi_periph)
{
    SPI_I2SCTL(spi_periph) |= SPI_I2SCTL_I2SEN;
}

/*!
    \brief      disable I2S (API_ID: 0x0009U)
    \param[in]  spi_periph: SPIx(x=1,2)
    \param[out] none
    \retval     none
*/
void i2s_disable(uint32_t spi_periph)
{
    SPI_I2SCTL(spi_periph) &= ~SPI_I2SCTL_I2SEN;
}

/*!
    \brief      enable SPI NSS output (API_ID: 0x000AU)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void spi_nss_output_enable(uint32_t spi_periph)
{
    SPI_CTL1(spi_periph) |= SPI_CTL1_NSSDRV;
}

/*!
    \brief      disable SPI NSS output (API_ID: 0x000BU)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void spi_nss_output_disable(uint32_t spi_periph)
{
    SPI_CTL1(spi_periph) &= ~SPI_CTL1_NSSDRV;
}

/*!
    \brief      SPI NSS pin high level in software mode (API_ID: 0x000CU)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void spi_nss_internal_high(uint32_t spi_periph)
{
    SPI_CTL0(spi_periph) |= SPI_CTL0_SWNSS;
}

/*!
    \brief      SPI NSS pin low level in software mode (API_ID: 0x000DU)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void spi_nss_internal_low(uint32_t spi_periph)
{
    SPI_CTL0(spi_periph) &= ~SPI_CTL0_SWNSS;
}

/*!
    \brief      enable SPI DMA send or receive (API_ID: 0x000EU)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[in]  dma: SPI DMA mode
                only one parameter can be selected which is shown as below:
      \arg        SPI_DMA_TRANSMIT: SPI transmit data use DMA
      \arg        SPI_DMA_RECEIVE: SPI receive data use DMA
    \param[out] none
    \retval     none
*/
void spi_dma_enable(uint32_t spi_periph, uint8_t dma)
{
    if(SPI_DMA_TRANSMIT == dma){
        SPI_CTL1(spi_periph) |= SPI_CTL1_DMATEN;
    }else{
        SPI_CTL1(spi_periph) |= SPI_CTL1_DMAREN;
    }
}

/*!
    \brief      disable SPI DMA send or receive (API_ID: 0x000FU)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[in]  dma: SPI DMA mode
                only one parameter can be selected which is shown as below:
      \arg        SPI_DMA_TRANSMIT: SPI transmit data use DMA
      \arg        SPI_DMA_RECEIVE: SPI receive data use DMA
    \param[out] none
    \retval     none
*/
void spi_dma_disable(uint32_t spi_periph, uint8_t dma)
{
    if(SPI_DMA_TRANSMIT == dma){
        SPI_CTL1(spi_periph) &= ~SPI_CTL1_DMATEN;
    }else{
        SPI_CTL1(spi_periph) &= ~SPI_CTL1_DMAREN;
    }
}

/*!
    \brief      configure SPI/I2S data frame format (API_ID: 0x0010U)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[in]  frame_format: SPI frame size
                only one parameter can be selected which is shown as below:
      \arg        SPI_FRAMESIZE_16BIT: SPI frame size is 16 bits
      \arg        SPI_FRAMESIZE_8BIT: SPI frame size is 8 bits
    \param[out] none
    \retval     none
*/
void spi_i2s_data_frame_format_config(uint32_t spi_periph, uint16_t frame_format)
{
    /* clear SPI_CTL0_FF16 bit */
    SPI_CTL0(spi_periph) &= ~SPI_CTL0_FF16;
    /* configure SPI_CTL0_FF16 bit */
    SPI_CTL0(spi_periph) |= (frame_format & SPI_CTL0_FF16);
}

/*!
    \brief      SPI transmit data (API_ID: 0x0011U)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[in]  data: 16-bit data
    \param[out] none
    \retval     none
*/
void spi_i2s_data_transmit(uint32_t spi_periph, uint16_t data)
{
    SPI_DATA(spi_periph) = (uint32_t)data;
}

/*!
    \brief      SPI receive data (API_ID: 0x0012U)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[out] none
    \retval     16-bit data
*/
uint16_t spi_i2s_data_receive(uint32_t spi_periph)
{
    return ((uint16_t)SPI_DATA(spi_periph));
}

/*!
    \brief      configure SPI bidirectional transfer direction (API_ID: 0x0013U)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[in]  transfer_direction: SPI transfer direction
                only one parameter can be selected which is shown as below:
      \arg        SPI_BIDIRECTIONAL_TRANSMIT: SPI work in transmit-only mode
      \arg        SPI_BIDIRECTIONAL_RECEIVE: SPI work in receive-only mode
    \param[out] none
    \retval     none
*/
void spi_bidirectional_transfer_config(uint32_t spi_periph, uint32_t transfer_direction)
{
    if(SPI_BIDIRECTIONAL_TRANSMIT == transfer_direction){
        /* set the transmit only mode */
        SPI_CTL0(spi_periph) |= SPI_BIDIRECTIONAL_TRANSMIT;
    }else{
        /* set the receive only mode */
        SPI_CTL0(spi_periph) &= SPI_BIDIRECTIONAL_RECEIVE;
    }
}

/*!
    \brief      clear SPI/I2S format error flag status (API_ID: 0x0014U)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[in]  flag: SPI/I2S frame format error flag 
      \arg        SPI_FLAG_FERR: only for SPI work in TI mode
      \arg        I2S_FLAG_FERR: for I2S
    \param[out] none
    \retval     none
*/
void spi_i2s_format_error_clear(uint32_t spi_periph, uint32_t flag)
{
    SPI_STAT(spi_periph) = ~(flag & SPI_FLAG_FERR);
}

/*!
    \brief      set SPI CRC polynomial (API_ID: 0x0015U)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[in]  crc_poly: CRC polynomial value
    \param[out] none
    \retval     none
*/
void spi_crc_polynomial_set(uint32_t spi_periph,uint16_t crc_poly)
{
    /* set SPI CRC polynomial */
    SPI_CRCPOLY(spi_periph) = (uint32_t)crc_poly;
}

/*!
    \brief      get SPI CRC polynomial (API_ID: 0x0016U)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[out] none
    \retval     16-bit CRC polynomial
*/
uint16_t spi_crc_polynomial_get(uint32_t spi_periph)
{
    return (uint16_t)SPI_CRCPOLY(spi_periph);
}

/*!
    \brief      turn on CRC function (API_ID: 0x0017U)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void spi_crc_on(uint32_t spi_periph)
{
    SPI_CTL0(spi_periph) |= SPI_CTL0_CRCEN;
}

/*!
    \brief      turn off CRC function (API_ID: 0x0018U)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void spi_crc_off(uint32_t spi_periph)
{
    SPI_CTL0(spi_periph) &= ~SPI_CTL0_CRCEN;
}

/*!
    \brief      SPI next data is CRC value (API_ID: 0x0019U)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void spi_crc_next(uint32_t spi_periph)
{
    SPI_CTL0(spi_periph) |= SPI_CTL0_CRCNT;
}

/*!
    \brief      get SPI CRC send value or receive value (API_ID: 0x001AU)
    \param[in]  spi_periph: SPIx(x=0,1,2)
    \param[in]  crc: SPI crc value
                only one parameter can be selected which is shown as below:
      \arg        SPI_CRC_TX: get transmit crc value
      \arg        SPI_CRC_RX: get receive crc value
    \param[out] none
    \retval     16-bit CRC value
*/

